TRUNCATE TABLE weather RESTART IDENTITY;

INSERT INTO weather (date, time, temperature, humidity, dew_point, pressure, wind_direction, wind_speed, cloudiness, cloud_base_height, horizontal_visibility, weather_phenomena)
VALUES
    ('2022-01-15', '08:00:00', -5.5, 70, -7.2, 760, 'С', 2.5, 40, 1500, 10.0, 'Снег'),
    ('2022-03-22', '12:00:00', 8.1, 55, 4.3, 758, 'ЮЗ', 5.0, 50, 1200, 8.5, 'Переменная облачность'),
    ('2022-07-10', '16:00:00', 25.7, 65, 18.1, 757, 'З', 4.1, 70, 1000, 7.0, 'Облачно'),
    ('2022-12-05', '09:00:00', 3.3, 70, 1.8, 761, 'СВ', 2.5, 40, 2000, 15.0, 'Легкий дождь'),
    ('2023-02-14', '13:00:00', -2.8, 58, -4.5, 759, 'Ю', 6.0, 60, 800, 5.0, 'Гроза'),
    ('2023-05-20', '17:00:00', 17.2, 62, 11.9, 760, 'СЗ', 3.8, 80, 900, 6.5, 'Туман'),
    ('2023-08-25', '07:00:00', 22.0, 75, 18.0, 762, 'В', 1.0, 20, 2500, 20.0, 'Ясно'),
    ('2023-09-30', '11:00:00', 16.5, 63, 11.2, 760, 'С', 2.0, 30, 1800, 12.0, 'Солнечно'),
    ('2024-04-12', '15:00:00', 14.0, 50, 9.0, 758, 'ЮВ', 4.5, 90, 700, 4.0, 'Ливень'),
    ('2024-12-24', '19:00:00', -10.0, 68, -12.8, 759, 'З', 3.0, 100, 600, 3.0, 'Сильный снегопад');

SELECT * FROM weather;