TRUNCATE TABLE weather RESTART IDENTITY;

INSERT INTO weather (date, time, temperature, humidity, dew_point, pressure, wind_direction, wind_speed, cloudiness, cloud_base_height, horizontal_visibility, weather_phenomena)
VALUES
    ('2023-10-01', '08:00:00', 15.5, 60, 10.2, 760, 'С', 3.2, 30, 1500, 10.0, 'Ясно'),
    ('2023-10-01', '12:00:00', 20.1, 55, 12.3, 758, 'ЮЗ', 5.0, 50, 1200, 8.5, 'Переменная облачность'),
    ('2023-10-01', '16:00:00', 18.7, 65, 13.1, 757, 'З', 4.1, 70, 1000, 7.0, 'Облачно'),
    ('2023-10-02', '09:00:00', 14.3, 70, 11.8, 761, 'СВ', 2.5, 40, 2000, 15.0, 'Легкий дождь'),
    ('2023-10-02', '13:00:00', 19.8, 58, 12.5, 759, 'Ю', 6.0, 60, 800, 5.0, 'Гроза'),
    ('2023-10-02', '17:00:00', 17.2, 62, 11.9, 760, 'СЗ', 3.8, 80, 900, 6.5, 'Туман'),
    ('2023-10-03', '07:00:00', 12.0, 75, 10.0, 762, 'В', 1.0, 20, 2500, 20.0, 'Ясно'),
    ('2023-10-03', '11:00:00', 16.5, 63, 11.2, 760, 'С', 2.0, 30, 1800, 12.0, 'Солнечно'),
    ('2023-10-03', '15:00:00', 21.0, 50, 13.0, 758, 'ЮВ', 4.5, 90, 700, 4.0, 'Ливень'),
    ('2023-10-03', '19:00:00', 18.0, 68, 12.8, 759, 'З', 3.0, 100, 600, 3.0, 'Сильный дождь');

SELECT * FROM weather;